app/views/home/dashboard/_admin.html.erb

SELECT COUNT(*) FROM "users"
SELECT COUNT(*) FROM "categories"
---
    <div class="space-y-2 text-gray-600">
      <p>Total de usuários: <span class="font-bold text-gray-900"><%= User.count %></span></p>
      <p>Total de categorias: <span class="font-bold text-gray-900"><%= Category.count %></span></p>
      <p>Despesas: <span class="font-bold text-red-600"><%= Category.expenses.count %></span> | Receitas: <span class="font-bold text-green-600"><%= Category.incomes.count %></span></p>