app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)
    authorize @category

    if @category.save
---
INSERT INTO "categories" ("name", "description", "color", "kind", "created_at", "updated_at") VALUES ('TESTANDO!!', 'Descrição.', '#f5c211', 1, '2026-03-02 04:25:22.772686', '2026-03-02 04:25:22.772686') RETURNING "id"